app/Controllers/EstudiantesController.php

    public function index(): string
    {
        $estudiantes = new EstudiantesModel();
        $datos['datos'] = $estudiantes->findAll();
---
SELECT *
FROM `estudiantes`

    public function buscarEstudiante($codigo){
        $estudiante = new EstudiantesModel();
        $datos['datos']=$estudiante->where('carne_alumno',$codigo)->first();
---
SELECT *
FROM `estudiantes`
WHERE `carne_alumno` = '2025001'
 LIMIT 1