app/Controllers/GradosController.php

    public function index(): string
    {
        $grados = new GradosModel();
        $datos['datos'] = $grados->findAll();
---
SELECT *
FROM `grados`