app/Controllers/Unidades3Controller.php

    public function agregarUnidad3(){
        $unidad3 = new Unidades3Model();
        $datos = [
            'carne_alumno'=>$this->request->getPost('txt_carne'),
            'curso_1'=>$this->request->getPost('txt_curso1'),
            'curso_2'=>$this->request->getPost('txt_curso2'),
            'curso_3'=>$this->request->getPost('txt_curso3'),
            'curso_4'=>$this->request->getPost('txt_curso4'),
            'curso_5'=>$this->request->getPost('txt_curso5')
        ];

        $unidad3->insert($datos);
---
INSERT INTO `unidad3` (`carne_alumno`, `curso_1`, `curso_2`, `curso_3`, `curso_4`, `curso_5`) VALUES ('2025001', '78', '78', '78', '78', '78')