app/Controllers/Unidades2Controller.php

    public function agregarUnidad2(){
        $unidad2 = new Unidades2Model();
        $datos = [
            'carne_alumno'=>$this->request->getPost('txt_carne'),
            'curso_1'=>$this->request->getPost('txt_curso1'),
            'curso_2'=>$this->request->getPost('txt_curso2'),
            'curso_3'=>$this->request->getPost('txt_curso3'),
            'curso_4'=>$this->request->getPost('txt_curso4'),
            'curso_5'=>$this->request->getPost('txt_curso5')
        ];

        $unidad2->insert($datos);
---
INSERT INTO `unidad2` (`carne_alumno`, `curso_1`, `curso_2`, `curso_3`, `curso_4`, `curso_5`) VALUES ('2025001', '80', '60', '89', '95', '77')