app/Controllers/UsuariosController.php

SELECT *
FROM `usuarios`
WHERE `email` = 'jose23@mail.com'
AND `password` = '123456'
 LIMIT 1
---
    public function index()
    {
        $email = $this->request->getPost('txt_usuario');
        $contra = $this->request->getPost('txt_contra');

        $usuarios = new UsuariosModel();
        //select * from usuarios where email = ... and possword = ...
        $datos= $usuarios->where('email',$email)->where('password',$contra)->first();

SELECT *
FROM `usuarios`
---
    public function mostraru(): string
    {
        $usuarios = new UsuariosModel();
        $datos['datos'] = $usuarios->findAll();

INSERT INTO `usuarios` (`usuario_id`, `nombre`, `email`, `password`, `tipo_usuario_id`) VALUES ('4', 'Juan Marquez', 'juan03@mail.com', 'marquez258', '2')
---
    public function agregarUsuario(){
        $usuario = new UsuariosModel();
        $datos = [
            'usuario_id'=>$this->request->getPost('txt_usuario'),
            'nombre'=>$this->request->getPost('txt_nombre'),
            'email'=>$this->request->getPost('txt_email'),
            'password'=>$this->request->getPost('txt_password'),
            'tipo_usuario_id'=>$this->request->getPost('txt_tipo')
        ];
            $usuario->insert($datos);

DELETE FROM `usuarios`
WHERE `usuario_id` IN ('8')
---
    public function eliminarUsuario($id){
        $usuario = new UsuariosModel();
        $usuario->delete($id);

SELECT *
FROM `usuarios`
WHERE `usuario_id` = '3'
 LIMIT 1
---
    public function buscarUsuario($codigo){
        $usuario = new UsuariosModel();
        $datos['datos']=$usuario->where('usuario_id',$codigo)->first();